In [1]:
"""行をずらす"""
import numpy as np
import pandas as pd

df = pd.DataFrame(np.random.randn(6, 4), index=pd.date_range('20220101', periods=6), columns=['A', 'B', 'C', 'D'])
df2 = df.copy()
df2['E'] = ['one',  'one', 'two', 'three', 'four', 'three']
df2.shift(1)

                   A         B         C         D      E
2022-01-01       NaN       NaN       NaN       NaN    NaN
2022-01-02  0.010286 -2.928486 -1.262276 -1.929657    one
2022-01-03 -1.347482 -0.125805 -1.022905  0.183743    one
2022-01-04 -0.714027  0.685431 -0.240065  0.084788    two
2022-01-05  0.822113  0.667813  0.838916 -0.511102  three
2022-01-06  0.970670  1.000258  0.915151 -0.808291   four